tutorials/caseFC/constant/channel/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          3000;
        startFace       824400;
    }
    outlet
    {
        type            patch;
        nFaces          3000;
        startFace       827400;
    }
    wall
    {
        type            patch;
        nFaces          21200;
        startFace       830400;
    }
    channel_to_LIB
    {
        type            directMappedWall;
        nFaces          4000;
        startFace       851600;
        sampleMode      nearestPatchFace;
        sampleRegion    LIB;
        samplePatch     LIB_to_channel;
        offset          (0 0 0);
    }
)


// ************************************************************************* //
